%%----------------Proj01-01：模式类实验数据的生成--------------%%
%%----------------Proj01-01-exp2----------------%%

clear; clc;
n = 1000;
%%生成两组各1000个具有不同均值和方差的一维高斯分布的随机数，然后统计并绘制这些点的直方图；

u1 = 0; u2 = 5;%均值
sigma1 = 5;  sigma2 = 10;%方差
r1 = u1 + sqrt(sigma1) * randn(n, 1);
r2 = u2 + sqrt(sigma2) * randn(n, 1);
figure(1);
subplot(1, 2, 1); hist(r1, 100); title('一维高斯分布直方图 \mu = 0, \sigma = 5');
subplot(1, 2, 2); hist(r2, 100); title('一维高斯分布直方图 \mu = 5, \sigma = 10');
axis tight;

%%生成三组各1000个具有不同均值矢量和协方差矩阵的二维随机矢量，并绘制出它们的二维散点图；
m1 = [3, 3]; m2 = [5, 5]; m3 = [10, 10];%均值
a1 = [1 0; 0 1]; a2 = [2 0; 0 2]; a3 = [3 0; 0 3];%协方差矩阵
g1 = mvnrnd(m1, a1, n);
g2 = mvnrnd(m2, a2, n);
g3 = mvnrnd(m3, a3, n);
figure(2);
scatter(g1(:, 1), g1(:, 2), '.');
hold on; scatter(g2(:, 1), g2(:, 2), 'x');
scatter(g3(:, 1), g3(:, 2), 'o');
title('二维高斯分布散点图');

%%生成五组各1000个具有不同均值矢量和协方差矩阵的三维随机矢量，并绘制出它们的三维散点图。
k1 = [1, 1, 1]; k2 = [3, 5, 5]; k3 = [10, 5, 10]; k4= [3, 10, 15]; k5= [10, 10, 15];%均值
b1 = [1 0 0; 0 1 0; 0 0 1]; b2 = [2 0 0; 0 5 0; 0 0 2]; b3 = [3 0 0; 0 3 0; 0 0 3]; 
b4 = [2 0 0; 0 10 0; 0 0 4]; b5 = [1 0 0; 0 5 0; 0 0 10];
h1 = mvnrnd(k1, b1, n);
h2 = mvnrnd(k2, b2, n);
h3 = mvnrnd(k3, b3, n);
h4 = mvnrnd(k4, b4, n);
h5 = mvnrnd(k5, b5, n);
figure(3);
scatter3(h1(:, 1), h1(:, 2), h1(:, 3), '.');
hold on; scatter3(h2(:, 1), h2(:, 2), h2(:, 3), 'x');
scatter3(h3(:, 1), h3(:, 2), h3(:, 3), 'o');
scatter3(h4(:, 1), h4(:, 2), h4(:, 3), '*');
scatter3(h5(:, 1), h5(:, 2), h5(:, 3), '+');
title('三维高斯分布散点图');

%%进一步，绘制上述三维随机矢量数据集合的二维投影散点图。
figure(4);%三维随机矢量数据集合在第1和第2两个维度的二维投影散点图
scatter(h1(:, 1), h1(:, 2), '.');
hold on; scatter(h2(:, 1), h2(:, 2), 'x');
scatter(h3(:, 1), h3(:, 2), 'o');
scatter(h4(:, 1), h4(:, 2), '*');
scatter(h5(:, 1), h5(:, 2), '+');
title('三维高斯分布的x-y投影散点图');

figure(5);%三维随机矢量数据集合在第1和第3两个维度的二维投影散点图
scatter(h1(:, 1), h1(:, 3), '.');
hold on; scatter(h2(:, 1), h2(:, 3), 'x');
scatter(h3(:, 1), h3(:, 3), 'o');
scatter(h4(:, 1), h4(:, 3), '*');
scatter(h5(:, 1), h5(:, 3), '+');
title('三维高斯分布的x-z投影散点图');

figure(6);%三维随机矢量数据集合在第2和第3两个维度的二维投影散点图
scatter(h1(:, 2), h1(:, 3), '.');
hold on; scatter(h2(:, 2), h2(:, 3), 'x');
scatter(h3(:, 2), h3(:, 3), 'o');
scatter(h4(:, 2), h4(:, 3), '*');
scatter(h5(:, 2), h5(:, 3), '+');
title('三维高斯分布的y-z投影散点图');