%%----------------Proj01-01：模式类实验数据的生成--------------%%
%%----------------Proj01-01-exp1----------------%%

clear; clc;

%%在一维区间[10,70]中，生成1000个均匀分布的随机数，然后统计并绘制这些数的直方图；
r = 10 + (70 - 10).* rand(1000, 1); % Generate values from the uniform distribution on the interval [a, b]. r = a + (b-a).*rand(100,1);
figure(1);
hist(r, 10: 70);
axis tight;
title('一维随机分布直方图');

%%在二维区间[1,5]*[20,30]中，生成5000个均匀分布的二维随机点，并绘制出它们的二维散点图；
x = 1 + (5 - 1).* rand(5000, 1);
y = 20 + (30 - 20).* rand(5000, 1);
figure(2);
scatter(x, y, '.', 'p');
title('二维随机分布散点图');

%%在三维区间[10,50]*[30,60]*[10,15]中，生成10000个均匀分布的三维随机点量，并绘制出它们的三维散点图。
x = 10 + (50 - 10).* rand(10000, 1);
y = 30 + (60 - 30).* rand(10000, 1);
z = 10 + (15 - 10).* rand(10000, 1);
figure(3);
scatter3(x, y, z, '.', 'p');
title('三维随机分布散点图');

