%%----------------Proj03-01：主分量分析PCA--------------%%
%%--------------------Proj03-01-exp1-------------------%%
clc; clear;
N = 100000;%样本数量
miu = [5; 7];%均值 
sigma = [9, 2.4; 2.4, 1];%协方差矩阵
X = mvnrnd(miu, sigma, N);%生成N个高斯分布的二维样本矢量
figure(1); plot(X(:, 1), X(:, 2), 'o'); title('样本集合X的二维散点图');
m = mean(X)';%样本集合X的均值向量
mm = repmat(m, 1, N);%%用矩阵的方法计算，repmat是复制和平铺矩阵
%S = (X' - mm) * (X' - mm)';
S = (N - 1) * cov(X);%散布矩阵
[V, D] = eig(S);%D的对角线元素是特征值，V的列是相应的特征向量
Y = V * (X' - mm);
figure(2); plot(Y(1, :), Y(2, :), '+'); title('集合Y的二维散点图');
figure(3); plot(X(:, 1), X(:, 2), 'o'); 
hold on; plot(Y(1, :), Y(2, :), '+'); title('样本集合X和集合Y的二维数据散点图');
